Revit 2027 API
GuidEnum.Guid Property
 The Guid of GUID-based enum object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Guid Guid { get; }
Public ReadOnly Property Guid As Guid
	Get
public:
property Guid Guid {
	Guid get ();
}
member Guid : Guid with get
Property Value
Guid
See Also
Reference
GuidEnum Class
Autodesk.Revit.DB Namespace